TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_epwm.h
//###########################################################################
//
// FILE:    hw_epwm.h
//
// TITLE:   Definitions for the EPWM registers.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HW_EPWM_H
#define HW_EPWM_H

//*************************************************************************************************
//
// The following are defines for the EPWM register offsets
//
//*************************************************************************************************
#define EPWM_O_XCMPCTL1         0x0U     // XCMP Mode Control Register
#define EPWM_O_XLOADCTL         0x10U    // XCMP Mode Load Control Register
#define EPWM_O_XLOAD            0x18U    // XCMP Mode Load Enable Register
#define EPWM_O_XLINKXLOAD       0x1CU    // Link register across PWM modules
#define EPWM_O_XREGSHDW1STS     0x20U    // Shadow Buffer 1 Update Status Register
#define EPWM_O_XREGSHDW2STS     0x28U    // Shadow Buffer 2 Update Status Register
#define EPWM_O_XREGSHDW3STS     0x30U    // Shadow Buffer 3 Update Status Register
#define EPWM_O_XCMP1_ACTIVE     0x200U   // Additional Compare 1 Active Register
#define EPWM_O_XCMP2_ACTIVE     0x204U   // Additional Compare 2 Active Register
#define EPWM_O_XCMP3_ACTIVE     0x208U   // Additional Compare 3 Active Register
#define EPWM_O_XCMP4_ACTIVE     0x20CU   // Additional Compare 4 Active Register
#define EPWM_O_XCMP5_ACTIVE     0x210U   // Additional Compare 5 Active Register
#define EPWM_O_XCMP6_ACTIVE     0x214U   // Additional Compare 6 Active Register
#define EPWM_O_XCMP7_ACTIVE     0x218U   // Additional Compare 7 Active Register
#define EPWM_O_XCMP8_ACTIVE     0x21CU   // Additional Compare 8 Active Register
#define EPWM_O_XTBPRD_ACTIVE    0x220U   // Additional Time Base Period Active Register
#define EPWM_O_XAQCTLA_ACTIVE   0x230U   // AQCTLA Active Register
#define EPWM_O_XAQCTLB_ACTIVE   0x232U   // AQCTLB Active Register
#define EPWM_O_XMINMAX_ACTIVE   0x244U   // XMINMAX Active Register
#define EPWM_O_XCMP1_SHDW1      0x280U   // Additional Compare 1 Shadow 1 Register
#define EPWM_O_XCMP2_SHDW1      0x284U   // Additional Compare 2 Shadow 1 Register
#define EPWM_O_XCMP3_SHDW1      0x288U   // Additional Compare 3 Shadow 1 Register
#define EPWM_O_XCMP4_SHDW1      0x28CU   // Additional Compare 4 Shadow 1 Register
#define EPWM_O_XCMP5_SHDW1      0x290U   // Additional Compare 5 Shadow 1 Register
#define EPWM_O_XCMP6_SHDW1      0x294U   // Additional Compare 6 Shadow 1 Register
#define EPWM_O_XCMP7_SHDW1      0x298U   // Additional Compare 7 Shadow 1 Register
#define EPWM_O_XCMP8_SHDW1      0x29CU   // Additional Compare 8 Shadow 1 Register
#define EPWM_O_XTBPRD_SHDW1     0x2A0U   // Additional Time Base Period Shadow 1 Register
#define EPWM_O_XAQCTLA_SHDW1    0x2B0U   // XAQCTLA Shadow 1 Register
#define EPWM_O_XAQCTLB_SHDW1    0x2B2U   // XAQCTLB Shadow 1 Register
#define EPWM_O_CMPC_SHDW1       0x2BAU   // CMPC Shadow 1 Register
#define EPWM_O_CMPD_SHDW1       0x2BEU   // CMPD Shadow 1 Register
#define EPWM_O_XMINMAX_SHDW1    0x2C4U   // XMINMAX Shadow 1 Register
#define EPWM_O_XCMP1_SHDW2      0x300U   // Additional Compare 1 Shadow 2 Register
#define EPWM_O_XCMP2_SHDW2      0x304U   // Additional Compare 2 Shadow 2 Register
#define EPWM_O_XCMP3_SHDW2      0x308U   // Additional Compare 3 Shadow 2 Register
#define EPWM_O_XCMP4_SHDW2      0x30CU   // Additional Compare 4 Shadow 2 Register
#define EPWM_O_XCMP5_SHDW2      0x310U   // Additional Compare 5 Shadow 2 Register
#define EPWM_O_XCMP6_SHDW2      0x314U   // Additional Compare 6 Shadow 2 Register
#define EPWM_O_XCMP7_SHDW2      0x318U   // Additional Compare 7 Shadow 2 Register
#define EPWM_O_XCMP8_SHDW2      0x31CU   // Additional Compare 8 Shadow 2 Register
#define EPWM_O_XTBPRD_SHDW2     0x320U   // Additional Time Base Period Shadow 2 Register
#define EPWM_O_XAQCTLA_SHDW2    0x330U   // XAQCTLA Shadow 2 Register
#define EPWM_O_XAQCTLB_SHDW2    0x332U   // XAQCTLB Shadow 2 Register
#define EPWM_O_CMPC_SHDW2       0x33AU   // CMPC Shadow 2 Register
#define EPWM_O_CMPD_SHDW2       0x33EU   // CMPD Shadow 2 Register
#define EPWM_O_XMINMAX_SHDW2    0x344U   // XMINMAX Shadow 2 Register
#define EPWM_O_XCMP1_SHDW3      0x380U   // Additional Compare 1 Shadow 3 Register
#define EPWM_O_XCMP2_SHDW3      0x384U   // Additional Compare 2 Shadow 3 Register
#define EPWM_O_XCMP3_SHDW3      0x388U   // Additional Compare 3 Shadow 3 Register
#define EPWM_O_XCMP4_SHDW3      0x38CU   // Additional Compare 4 Shadow 3 Register
#define EPWM_O_XCMP5_SHDW3      0x390U   // Additional Compare 5 Shadow 3 Register
#define EPWM_O_XCMP6_SHDW3      0x394U   // Additional Compare 6 Shadow 3 Register
#define EPWM_O_XCMP7_SHDW3      0x398U   // Additional Compare 7 Shadow 3 Register
#define EPWM_O_XCMP8_SHDW3      0x39CU   // Additional Compare 8 Shadow 3 Register
#define EPWM_O_XTBPRD_SHDW3     0x3A0U   // Additional Time Base Period Shadow 3 Register
#define EPWM_O_XAQCTLA_SHDW3    0x3B0U   // XAQCTLA Shadow 3 Register
#define EPWM_O_XAQCTLB_SHDW3    0x3B2U   // XAQCTLB Shadow 3 Register
#define EPWM_O_CMPC_SHDW3       0x3BAU   // CMPC Shadow 3 Register
#define EPWM_O_CMPD_SHDW3       0x3BEU   // CMPD Shadow 3 Register
#define EPWM_O_XMINMAX_SHDW3    0x3C4U   // XMINMAX Shadow 3 Register

#define EPWM_O_TBCTL              0x0U     // Time Base Control Register
#define EPWM_O_TBCTL2             0x2U     // Time Base Control Register 2
#define EPWM_O_SYNCINSEL          0x6U     // EPWMxSYNCIN Source Select Register
#define EPWM_O_TBCTR              0x8U     // Time Base Counter Register
#define EPWM_O_TBSTS              0xAU     // Time Base Status Register
#define EPWM_O_SYNCOUTEN          0xCU     // EPWMxSYNCOUT Source Enable Register
#define EPWM_O_TBCTL3             0xEU     // Time Base Control Register 3
#define EPWM_O_CMPCTL             0x10U    // Counter Compare Control Register
#define EPWM_O_CMPCTL2            0x12U    // Counter Compare Control Register 2
#define EPWM_O_DBCTL              0x18U    // Dead-Band Generator Control Register
#define EPWM_O_DBCTL2             0x1AU    // Dead-Band Generator Control Register 2
#define EPWM_O_AQCTL              0x20U    // Action Qualifier Control Register
#define EPWM_O_AQTSRCSEL          0x22U    // Action Qualifier Trigger Event Source Select Register
#define EPWM_O_PCCTL              0x28U    // PWM Chopper Control Register
#define EPWM_O_VCAPCTL            0x30U    // Valley Capture Control Register
#define EPWM_O_VCNTCFG            0x32U    // Valley Counter Config Register
#define EPWM_O_HRCNFG             0x40U    // HRPWM Configuration Register
#define EPWM_O_HRCNFG2            0x4EU    // HRPWM Configuration 2 Register
#define EPWM_O_HRPCTL             0x5AU    // High Resolution Period Control Register
#define EPWM_O_TRREM              0x5CU    // HRPWM High Resolution Remainder Register
#define EPWM_O_GLDCTL             0x68U    // Global PWM Load Control Register
#define EPWM_O_GLDCFG             0x6AU    // Global PWM Load Config Register
#define EPWM_O_AQCTLA             0x80U    // Action Qualifier Control Register For Output A
#define EPWM_O_AQCTLA2            0x82U    // Additional Action Qualifier Control Register For
                                           // Output A
#define EPWM_O_AQCTLB             0x84U    // Action Qualifier Control Register For Output B
#define EPWM_O_AQCTLB2            0x86U    // Additional Action Qualifier Control Register For
                                           // Output B
#define EPWM_O_AQSFRC             0x8EU    // Action Qualifier Software Force Register
#define EPWM_O_AQCSFRC            0x92U    // Action Qualifier Continuous S/W Force Register
#define EPWM_O_DBREDHR            0xA0U    // Dead-Band Generator Rising Edge Delay High Resolution
                                           // Mirror Register
#define EPWM_O_DBRED              0xA2U    // Dead-Band Generator Rising Edge Delay High Resolution
                                           // Mirror Register
#define EPWM_O_DBFEDHR            0xA4U    // Dead-Band Generator Falling Edge Delay High
                                           // Resolution Register
#define EPWM_O_DBFED              0xA6U    // Dead-Band Generator Falling Edge Delay Count Register
#define EPWM_O_TBPHS              0xC0U    // Time Base Phase High
#define EPWM_O_TBPRDHR            0xC4U    // Time Base Period High Resolution Register
#define EPWM_O_TBPRD              0xC6U    // Time Base Period Register
#define EPWM_O_CMPA               0xD4U    // Counter Compare A Register
#define EPWM_O_CMPB               0xD8U    // Compare B Register
#define EPWM_O_CMPC               0xDEU    // Counter Compare C Register
#define EPWM_O_CMPD               0xE2U    // Counter Compare D Register
#define EPWM_O_GLDCTL2            0xE8U    // Global PWM Load Control Register 2
#define EPWM_O_SWVDELVAL          0xEEU    // Software Valley Mode Delay Register
#define EPWM_O_TZSEL              0x100U   // Trip Zone Select Register
#define EPWM_O_TZSEL2             0x102U   // Trip Zone Select Register 2
#define EPWM_O_TZDCSEL            0x104U   // Trip Zone Digital Comparator Select Register
#define EPWM_O_TZCTL              0x108U   // Trip Zone Control Register
#define EPWM_O_TZCTL2             0x10AU   // Additional Trip Zone Control Register
#define EPWM_O_TZCTLDCA           0x10CU   // Trip Zone Control Register Digital Compare A
#define EPWM_O_TZCTLDCB           0x10EU   // Trip Zone Control Register Digital Compare B
#define EPWM_O_TZEINT             0x11AU   // Trip Zone Enable Interrupt Register
#define EPWM_O_TZFLG              0x126U   // Trip Zone Flag Register
#define EPWM_O_TZCBCFLG           0x128U   // Trip Zone CBC Flag Register
#define EPWM_O_TZOSTFLG           0x12AU   // Trip Zone OST Flag Register
#define EPWM_O_TZCLR              0x12EU   // Trip Zone Clear Register
#define EPWM_O_TZCBCCLR           0x130U   // Trip Zone CBC Clear Register
#define EPWM_O_TZOSTCLR           0x132U   // Trip Zone OST Clear Register
#define EPWM_O_TZFRC              0x136U   // Trip Zone Force Register
#define EPWM_O_TZTRIPOUTSEL       0x13AU   // Trip Zone Force Register
#define EPWM_O_ETSEL              0x148U   // Event Trigger Selection Register
#define EPWM_O_ETPS               0x14CU   // Event Trigger Pre-Scale Register
#define EPWM_O_ETFLG              0x150U   // Event Trigger Flag Register
#define EPWM_O_ETCLR              0x154U   // Event Trigger Clear Register
#define EPWM_O_ETFRC              0x158U   // Event Trigger Force Register
#define EPWM_O_ETINTPS            0x15CU   // Event-Trigger Interrupt Pre-Scale Register
#define EPWM_O_ETSOCPS            0x160U   // Event-Trigger SOC Pre-Scale Register
#define EPWM_O_ETCNTINITCTL       0x164U   // Event-Trigger Counter Initialization Control Register
#define EPWM_O_ETCNTINIT          0x168U   // Event-Trigger Counter Initialization Register
#define EPWM_O_ETINTMIXEN         0x16CU   // Event-Trigger Mixed INT Selection
#define EPWM_O_ETSOCAMIXEN        0x170U   // Event-Trigger Mixed SOCA Selection
#define EPWM_O_ETSOCBMIXEN        0x174U   // Event-Trigger Mixed SOCB Selection
#define EPWM_O_DCTRIPSEL          0x180U   // Digital Compare Trip Select Register
#define EPWM_O_DCACTL             0x186U   // Digital Compare A Control Register
#define EPWM_O_DCBCTL             0x188U   // Digital Compare B Control Register
#define EPWM_O_DCFCTL             0x18EU   // Digital Compare Filter Control Register
#define EPWM_O_DCCAPCTL           0x190U   // Digital Compare Capture Control Register
#define EPWM_O_DCFOFFSET          0x192U   // Digital Compare Filter Offset Register
#define EPWM_O_DCFOFFSETCNT       0x194U   // Digital Compare Filter Offset Counter Register
#define EPWM_O_DCFWINDOW          0x196U   // Digital Compare Filter Window Register
#define EPWM_O_DCFWINDOWCNT       0x198U   // Digital Compare Filter Window Counter Register
#define EPWM_O_BLANKPULSEMIXSEL   0x19AU   // Blanking window trigger pulse select register
#define EPWM_O_DCCAPMIXSEL        0x19CU   // Capture Event pulse select register
#define EPWM_O_DCCAP              0x19EU   // Digital Compare Counter Capture Register
#define EPWM_O_DCAHTRIPSEL        0x1A4U   // Digital Compare AH Trip Select
#define EPWM_O_DCALTRIPSEL        0x1A6U   // Digital Compare AL Trip Select
#define EPWM_O_DCBHTRIPSEL        0x1A8U   // Digital Compare BH Trip Select
#define EPWM_O_DCBLTRIPSEL        0x1AAU   // Digital Compare BL Trip Select
#define EPWM_O_CAPCTL             0x1ACU   // Event Capture Control Register
#define EPWM_O_CAPGATETRIPSEL     0x1AEU   // Event Capture Gate Trip input select
#define EPWM_O_CAPINTRIPSEL       0x1B0U   // Event Capture Trip input select
#define EPWM_O_CAPTRIPSEL         0x1B2U   // Event Capture Signal Select
#define EPWM_O_LOCK               0x1F4U   // EPWM Lock Register
#define EPWM_O_HWVDELVAL          0x1FAU   // Hardware Valley Mode Delay Register
#define EPWM_O_VCNTVAL            0x1FCU   // Hardware Valley Counter Register

#define EPWM_O_DECTL        0x0U    // DE control register
#define EPWM_O_DECOMPSEL    0x4U    // DE comparator source select register
#define EPWM_O_DEACTCTL     0x8U    // DE Action Control
#define EPWM_O_DESTS        0xCU    // DE Status register
#define EPWM_O_DEFRC        0x10U   // DE Status force register
#define EPWM_O_DECLR        0x14U   // DE Status clear register
#define EPWM_O_DEMONCNT     0x20U   // DE trip monitor counter
#define EPWM_O_DEMONCTL     0x24U   // DE monitor mode control
#define EPWM_O_DEMONSTEP    0x28U   // DE monitor counter step
#define EPWM_O_DEMONTHRES   0x2CU   // DE monitor counter threshold

#define EPWM_O_MINDBCFG   0x0U    // Minimum dead band configuration register.
#define EPWM_O_MINDBDLY   0x4U    // Minimum dead band delay register
#define EPWM_O_LUTCTLA    0x20U   // LUT control register on PWMA
#define EPWM_O_LUTCTLB    0x24U   // LUT control register on PWMB


//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMPCTL1 register
//
//*************************************************************************************************
#define EPWM_XCMPCTL1_XCMPEN          0x1U     // XCMP Compare Register Operation Enable
#define EPWM_XCMPCTL1_XCMPSPLIT       0x2U     // XCMP Register Allocation Options
#define EPWM_XCMPCTL1_XCMPA_ALLOC_S   4U
#define EPWM_XCMPCTL1_XCMPA_ALLOC_M   0xF0U    // XCMPn register allocation for CMPA
#define EPWM_XCMPCTL1_XCMPB_ALLOC_S   8U
#define EPWM_XCMPCTL1_XCMPB_ALLOC_M   0xF00U   // XCMPn register allocation for CMPB

//*************************************************************************************************
//
// The following are defines for the bit fields in the XLOADCTL register
//
//*************************************************************************************************
#define EPWM_XLOADCTL_LOADMODE                    0x4U          // Load mode selection for Shadow
                                                                // registers
#define EPWM_XLOADCTL_SHDWLEVEL_S                 4U
#define EPWM_XLOADCTL_SHDWLEVEL_M                 0x30U         // Shadow Register Level Allocation
                                                                // Options
#define EPWM_XLOADCTL_SHDWBUFPTR_LOADONCE_S       8U
#define EPWM_XLOADCTL_SHDWBUFPTR_LOADONCE_M       0x300U        // Register Load event count
#define EPWM_XLOADCTL_SHDWBUFPTR_LOADMULTIPLE_S   10U
#define EPWM_XLOADCTL_SHDWBUFPTR_LOADMULTIPLE_M   0xC00U        // Register Load event count
#define EPWM_XLOADCTL_RPTBUF2PRD_S                16U
#define EPWM_XLOADCTL_RPTBUF2PRD_M                0x70000U      // Repeat Count Shadow Buffer 2
#define EPWM_XLOADCTL_RPTBUF2CNT_S                20U
#define EPWM_XLOADCTL_RPTBUF2CNT_M                0x700000U     // Repeat Count Status Shadow
                                                                // Buffer 2
#define EPWM_XLOADCTL_RPTBUF3PRD_S                24U
#define EPWM_XLOADCTL_RPTBUF3PRD_M                0x7000000U    // Repeat Count Shadow Buffer 3
#define EPWM_XLOADCTL_RPTBUF3CNT_S                28U
#define EPWM_XLOADCTL_RPTBUF3CNT_M                0x70000000U   // Repeat Count Status Shadow
                                                                // Buffer 3

//*************************************************************************************************
//
// The following are defines for the bit fields in the XLOAD register
//
//*************************************************************************************************
#define EPWM_XLOAD_STARTLD   0x1U   // Enable register loading of shadow buffers
#define EPWM_XLOAD_FRCLD     0x2U   // Force register loading of shadow buffers

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINKXLOAD register
//
//*************************************************************************************************
#define EPWM_XLINKXLOAD_XLOADLINK_S   0U
#define EPWM_XLINKXLOAD_XLOADLINK_M   0x1FU   // XLOAD  Link Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XREGSHDW1STS register
//
//*************************************************************************************************
#define EPWM_XREGSHDW1STS_XCMP1_SHDW1FULL     0x1U      // XCMP1_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP2_SHDW1FULL     0x2U      // XCMP2_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP3_SHDW1FULL     0x4U      // XCMP3_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP4_SHDW1FULL     0x8U      // XCMP4_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP5_SHDW1FULL     0x10U     // XCMP5_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP6_SHDW1FULL     0x20U     // XCMP6_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP7_SHDW1FULL     0x40U     // XCMP7_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP8_SHDW1FULL     0x80U     // XCMP8_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XTBPRD_SHDW1FULL    0x100U    // XTBPRD_SHDW1 register full Status flag:
#define EPWM_XREGSHDW1STS_CMPC_SHDW1FULL      0x200U    // CMPC_SHDW1 register full Status flag:
#define EPWM_XREGSHDW1STS_CMPD_SHDW1FULL      0x400U    // CMPD_SHDW1 register full Status flag:
#define EPWM_XREGSHDW1STS_XAQCTLA_SHDW1FULL   0x800U    // XAQCTLA_SHDW1 register full Status flag:
#define EPWM_XREGSHDW1STS_XAQCTLB_SHDW1FULL   0x1000U   // XAQCTLB_SHDW1 register full Status flag:
#define EPWM_XREGSHDW1STS_XMAX_SHDW1FULL      0x2000U   // XMINMAX_SHDW1 register full Status
                                                        // flag:MAX field update
#define EPWM_XREGSHDW1STS_XMIN_SHDW1FULL      0x4000U   // XMINMAX_SHDW1 register full Status flag:
                                                        // MIN field update

//*************************************************************************************************
//
// The following are defines for the bit fields in the XREGSHDW2STS register
//
//*************************************************************************************************
#define EPWM_XREGSHDW2STS_XCMP1_SHDW2FULL     0x1U      // XCMP1_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP2_SHDW2FULL     0x2U      // XCMP2_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP3_SHDW2FULL     0x4U      // XCMP3_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP4_SHDW2FULL     0x8U      // XCMP4_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP5_SHDW2FULL     0x10U     // XCMP5_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP6_SHDW2FULL     0x20U     // XCMP6_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP7_SHDW2FULL     0x40U     // XCMP7_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP8_SHDW2FULL     0x80U     // XCMP8_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XTBPRD_SHDW2FULL    0x100U    // XTBPRD_SHDW2 register full Status flag:
#define EPWM_XREGSHDW2STS_CMPC_SHDW2FULL      0x200U    // CMPC_SHDW2 register full Status flag:
#define EPWM_XREGSHDW2STS_CMPD_SHDW2FULL      0x400U    // CMPD_SHDW2 register full Status flag:
#define EPWM_XREGSHDW2STS_XAQCTLA_SHDW2FULL   0x800U    // XAQCTLA_SHDW2 register full Status flag:
#define EPWM_XREGSHDW2STS_XAQCTLB_SHDW2FULL   0x1000U   // XAQCTLB_SHDW2 register full Status flag:
#define EPWM_XREGSHDW2STS_XMAX_SHDW2FULL      0x2000U   // XMINMAX_SHDW2 register full Status
                                                        // flag:MAX field update
#define EPWM_XREGSHDW2STS_XMIN_SHDW2FULL      0x4000U   // XMINMAX_SHDW2 register full Status flag:
                                                        // MIN field update

