TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_epwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the XTBPRD_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_S   0U
#define EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_M   0xFFFFU       // Additional Time Base Period Shadow 1
                                                           // HR Register
#define EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_S     16U
#define EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_M     0xFFFF0000U   // Additional Time Base Period Shadow 1
                                                           // Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLA_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XAQCTLA_SHDW2_XCMP1_S   0U
#define EPWM_XAQCTLA_SHDW2_XCMP1_M   0x3U      // XCMP1 Action
#define EPWM_XAQCTLA_SHDW2_XCMP2_S   2U
#define EPWM_XAQCTLA_SHDW2_XCMP2_M   0xCU      // XCMP2 Action
#define EPWM_XAQCTLA_SHDW2_XCMP3_S   4U
#define EPWM_XAQCTLA_SHDW2_XCMP3_M   0x30U     // XCMP3 Action
#define EPWM_XAQCTLA_SHDW2_XCMP4_S   6U
#define EPWM_XAQCTLA_SHDW2_XCMP4_M   0xC0U     // XCMP4 Action
#define EPWM_XAQCTLA_SHDW2_XCMP5_S   8U
#define EPWM_XAQCTLA_SHDW2_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLA_SHDW2_XCMP6_S   10U
#define EPWM_XAQCTLA_SHDW2_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLA_SHDW2_XCMP7_S   12U
#define EPWM_XAQCTLA_SHDW2_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLA_SHDW2_XCMP8_S   14U
#define EPWM_XAQCTLA_SHDW2_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLB_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XAQCTLB_SHDW2_XCMP5_S   8U
#define EPWM_XAQCTLB_SHDW2_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLB_SHDW2_XCMP6_S   10U
#define EPWM_XAQCTLB_SHDW2_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLB_SHDW2_XCMP7_S   12U
#define EPWM_XAQCTLB_SHDW2_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLB_SHDW2_XCMP8_S   14U
#define EPWM_XAQCTLB_SHDW2_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XMINMAX_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XMINMAX_SHDW2_XMAX_SHDW2_S   0U
#define EPWM_XMINMAX_SHDW2_XMAX_SHDW2_M   0xFFFFU       // Maximum Valude  for Capture Counter
                                                        // Active Register
#define EPWM_XMINMAX_SHDW2_XMIN_SHDW2_S   16U
#define EPWM_XMINMAX_SHDW2_XMIN_SHDW2_M   0xFFFF0000U   // Minimum Valude  for Capture Counter
                                                        // Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP1_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_S   0U
#define EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_M   0xFFFFU       // Additional Compare 1 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP1_SHDW3_XCMP1_SHDW3_S     16U
#define EPWM_XCMP1_SHDW3_XCMP1_SHDW3_M     0xFFFF0000U   // Additional Compare 1 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP2_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_S   0U
#define EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_M   0xFFFFU       // Additional Compare 2 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP2_SHDW3_XCMP2_SHDW3_S     16U
#define EPWM_XCMP2_SHDW3_XCMP2_SHDW3_M     0xFFFF0000U   // Additional Compare 2 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP3_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_S   0U
#define EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_M   0xFFFFU       // Additional Compare 3 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP3_SHDW3_XCMP3_SHDW3_S     16U
#define EPWM_XCMP3_SHDW3_XCMP3_SHDW3_M     0xFFFF0000U   // Additional Compare 3 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP4_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP4_SHDW3_XCMP4HR_SHDW3_S   0U
#define EPWM_XCMP4_SHDW3_XCMP4HR_SHDW3_M   0xFFFFU       // Additional Compare 4 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP4_SHDW3_XCMP4_SHDW3_S     16U
#define EPWM_XCMP4_SHDW3_XCMP4_SHDW3_M     0xFFFF0000U   // Additional Compare 4 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP5_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP5_SHDW3_XCMP5HR_SHDW3_S   0U
#define EPWM_XCMP5_SHDW3_XCMP5HR_SHDW3_M   0xFFFFU       // Additional Compare 5 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP5_SHDW3_XCMP5_SHDW3_S     16U
#define EPWM_XCMP5_SHDW3_XCMP5_SHDW3_M     0xFFFF0000U   // Additional Compare 5 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP6_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP6_SHDW3_XCMP6HR_SHDW3_S   0U
#define EPWM_XCMP6_SHDW3_XCMP6HR_SHDW3_M   0xFFFFU       // Additional Compare 6 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP6_SHDW3_XCMP6_SHDW3_S     16U
#define EPWM_XCMP6_SHDW3_XCMP6_SHDW3_M     0xFFFF0000U   // Additional Compare 6 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP7_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP7_SHDW3_XCMP7HR_SHDW3_S   0U
#define EPWM_XCMP7_SHDW3_XCMP7HR_SHDW3_M   0xFFFFU       // Additional Compare 7 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP7_SHDW3_XCMP7_SHDW3_S     16U
#define EPWM_XCMP7_SHDW3_XCMP7_SHDW3_M     0xFFFF0000U   // Additional Compare 7 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP8_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP8_SHDW3_XCMP8HR_SHDW3_S   0U
#define EPWM_XCMP8_SHDW3_XCMP8HR_SHDW3_M   0xFFFFU       // Additional Compare 8 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP8_SHDW3_XCMP8_SHDW3_S     16U
#define EPWM_XCMP8_SHDW3_XCMP8_SHDW3_M     0xFFFF0000U   // Additional Compare 8 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTBPRD_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XTBPRD_SHDW3_XTBPRDHR_SHDW3_S   0U
#define EPWM_XTBPRD_SHDW3_XTBPRDHR_SHDW3_M   0xFFFFU       // Additional Time Base Period Shadow 1
                                                           // HR Register
#define EPWM_XTBPRD_SHDW3_XTBPRD_SHDW3_S     16U
#define EPWM_XTBPRD_SHDW3_XTBPRD_SHDW3_M     0xFFFF0000U   // Additional Time Base Period Shadow 1
                                                           // Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLA_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XAQCTLA_SHDW3_XCMP1_S   0U
#define EPWM_XAQCTLA_SHDW3_XCMP1_M   0x3U      // XCMP1 Action
#define EPWM_XAQCTLA_SHDW3_XCMP2_S   2U
#define EPWM_XAQCTLA_SHDW3_XCMP2_M   0xCU      // XCMP2 Action
#define EPWM_XAQCTLA_SHDW3_XCMP3_S   4U
#define EPWM_XAQCTLA_SHDW3_XCMP3_M   0x30U     // XCMP3 Action
#define EPWM_XAQCTLA_SHDW3_XCMP4_S   6U
#define EPWM_XAQCTLA_SHDW3_XCMP4_M   0xC0U     // XCMP4 Action
#define EPWM_XAQCTLA_SHDW3_XCMP5_S   8U
#define EPWM_XAQCTLA_SHDW3_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLA_SHDW3_XCMP6_S   10U
#define EPWM_XAQCTLA_SHDW3_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLA_SHDW3_XCMP7_S   12U
#define EPWM_XAQCTLA_SHDW3_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLA_SHDW3_XCMP8_S   14U
#define EPWM_XAQCTLA_SHDW3_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLB_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XAQCTLB_SHDW3_XCMP5_S   8U
#define EPWM_XAQCTLB_SHDW3_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLB_SHDW3_XCMP6_S   10U
#define EPWM_XAQCTLB_SHDW3_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLB_SHDW3_XCMP7_S   12U
#define EPWM_XAQCTLB_SHDW3_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLB_SHDW3_XCMP8_S   14U
#define EPWM_XAQCTLB_SHDW3_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XMINMAX_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XMINMAX_SHDW3_XMAX_SHDW3_S   0U
#define EPWM_XMINMAX_SHDW3_XMAX_SHDW3_M   0xFFFFU       // Maximum Valude  for Capture Counter
                                                        // Active Register
#define EPWM_XMINMAX_SHDW3_XMIN_SHDW3_S   16U
#define EPWM_XMINMAX_SHDW3_XMIN_SHDW3_M   0xFFFF0000U   // Minimum Valude  for Capture Counter
                                                        // Active Register


//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL register
//
//*************************************************************************************************
#define EPWM_TBCTL_CTRMODE_S     0U
#define EPWM_TBCTL_CTRMODE_M     0x3U      // Counter Mode
#define EPWM_TBCTL_PHSEN         0x4U      // Phase Load Enable
#define EPWM_TBCTL_PRDLD         0x8U      // Active Period Load
#define EPWM_TBCTL_SWFSYNC       0x40U     // Software Force Sync Pulse
#define EPWM_TBCTL_HSPCLKDIV_S   7U
#define EPWM_TBCTL_HSPCLKDIV_M   0x380U    // High Speed TBCLK Pre-scaler
#define EPWM_TBCTL_CLKDIV_S      10U
#define EPWM_TBCTL_CLKDIV_M      0x1C00U   // Time Base Clock Pre-scaler
#define EPWM_TBCTL_PHSDIR        0x2000U   // Phase Direction Bit
#define EPWM_TBCTL_FREE_SOFT_S   14U
#define EPWM_TBCTL_FREE_SOFT_M   0xC000U   // Emulation Mode Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL2 register
//
//*************************************************************************************************
#define EPWM_TBCTL2_OSHTSYNCMODE   0x40U     // One shot sync mode
#define EPWM_TBCTL2_OSHTSYNC       0x80U     // One shot sync
#define EPWM_TBCTL2_PRDLDSYNC_S    14U
#define EPWM_TBCTL2_PRDLDSYNC_M    0xC000U   // PRD Shadow to Active Load on SYNC Event

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMSYNCINSEL register
//
//*************************************************************************************************
#define EPWM_SYNCINSEL_SEL_S   0U
#define EPWM_SYNCINSEL_SEL_M   0x7FU   // EPWMxSYNCI source select

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBSTS register
//
//*************************************************************************************************
#define EPWM_TBSTS_CTRDIR   0x1U   // Counter Direction Status
#define EPWM_TBSTS_SYNCI    0x2U   // External Input Sync Status
#define EPWM_TBSTS_CTRMAX   0x4U   // Counter Max Latched Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMSYNCOUTEN register
//
//*************************************************************************************************
#define EPWM_SYNCOUTEN_SWEN        0x1U    // EPWMxSYNCO Software Force Enable
#define EPWM_SYNCOUTEN_ZEROEN      0x2U    // EPWMxSYNCO Zero Count Event Enable
#define EPWM_SYNCOUTEN_CMPBEN      0x4U    // EPWMxSYNCO Compare B Event Enable
#define EPWM_SYNCOUTEN_CMPCEN      0x8U    // EPWMxSYNCO Compare C Event Enable
#define EPWM_SYNCOUTEN_CMPDEN      0x10U   // EPWMxSYNCO Compare D Event Enable
#define EPWM_SYNCOUTEN_DCAEVT1EN   0x20U   // EPWMxSYNCO Digital Compare A Event 1 Sync Enable
#define EPWM_SYNCOUTEN_DCBEVT1EN   0x40U   // EPWMxSYNCO Digital Compare B Event 1 Sync Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL3 register
//
//*************************************************************************************************
#define EPWM_TBCTL3_OSSFRCEN   0x1U   // One Shot Sync Force Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPCTL register
//
//*************************************************************************************************
#define EPWM_CMPCTL_LOADAMODE_S   0U
#define EPWM_CMPCTL_LOADAMODE_M   0x3U      // Active Compare A Load
#define EPWM_CMPCTL_LOADBMODE_S   2U
#define EPWM_CMPCTL_LOADBMODE_M   0xCU      // Active Compare B Load
#define EPWM_CMPCTL_SHDWAMODE     0x10U     // Compare A Register Block Operating Mode
#define EPWM_CMPCTL_SHDWBMODE     0x40U     // Compare B Register Block Operating Mode
#define EPWM_CMPCTL_SHDWAFULL     0x100U    // Compare A Shadow Register Full Status
#define EPWM_CMPCTL_SHDWBFULL     0x200U    // Compare B Shadow Register Full Status
#define EPWM_CMPCTL_LOADASYNC_S   10U
#define EPWM_CMPCTL_LOADASYNC_M   0xC00U    // Active Compare A Load on SYNC
#define EPWM_CMPCTL_LOADBSYNC_S   12U
#define EPWM_CMPCTL_LOADBSYNC_M   0x3000U   // Active Compare B Load on SYNC
#define EPWM_CMPCTL_LINKDUTYHR    0x8000U   // Enable same values on CMPAHR/CMPBHR

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPCTL2 register
//
//*************************************************************************************************
#define EPWM_CMPCTL2_LOADCMODE_S   0U
#define EPWM_CMPCTL2_LOADCMODE_M   0x3U      // Active Compare C Load
#define EPWM_CMPCTL2_LOADDMODE_S   2U
#define EPWM_CMPCTL2_LOADDMODE_M   0xCU      // Active Compare D load
#define EPWM_CMPCTL2_SHDWCMODE     0x10U     // Compare C Block Operating Mode
#define EPWM_CMPCTL2_SHDWDMODE     0x40U     // Compare D Block Operating Mode
#define EPWM_CMPCTL2_LOADCSYNC_S   10U
#define EPWM_CMPCTL2_LOADCSYNC_M   0xC00U    // Active Compare C Load on SYNC
#define EPWM_CMPCTL2_LOADDSYNC_S   12U
#define EPWM_CMPCTL2_LOADDSYNC_M   0x3000U   // Active Compare D Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBCTL register
//
//*************************************************************************************************
#define EPWM_DBCTL_OUT_MODE_S      0U
#define EPWM_DBCTL_OUT_MODE_M      0x3U      // Dead Band Output Mode Control
#define EPWM_DBCTL_POLSEL_S        2U
#define EPWM_DBCTL_POLSEL_M        0xCU      // Polarity Select Control
#define EPWM_DBCTL_IN_MODE_S       4U
#define EPWM_DBCTL_IN_MODE_M       0x30U     // Dead Band Input Select Mode Control
#define EPWM_DBCTL_LOADREDMODE_S   6U
#define EPWM_DBCTL_LOADREDMODE_M   0xC0U     // Active DBRED Load Mode
#define EPWM_DBCTL_LOADFEDMODE_S   8U
#define EPWM_DBCTL_LOADFEDMODE_M   0x300U    // Active DBFED Load Mode
#define EPWM_DBCTL_SHDWDBREDMODE   0x400U    // DBRED Block Operating Mode
#define EPWM_DBCTL_SHDWDBFEDMODE   0x800U    // DBFED Block Operating Mode
#define EPWM_DBCTL_OUTSWAP_S       12U
#define EPWM_DBCTL_OUTSWAP_M       0x3000U   // Dead Band Output Swap Control
#define EPWM_DBCTL_DEDB_MODE       0x4000U   // Dead Band Dual-Edge B Mode Control
#define EPWM_DBCTL_HALFCYCLE       0x8000U   // Half Cycle Clocking Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBCTL2 register
//
//*************************************************************************************************
#define EPWM_DBCTL2_LOADDBCTLMODE_S   0U
#define EPWM_DBCTL2_LOADDBCTLMODE_M   0x3U   // DBCTL Load from Shadow Mode Select
#define EPWM_DBCTL2_SHDWDBCTLMODE     0x4U   // DBCTL Load mode Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTL register
//
//*************************************************************************************************
#define EPWM_AQCTL_LDAQAMODE_S   0U
#define EPWM_AQCTL_LDAQAMODE_M   0x3U     // Action Qualifier A Load Select
#define EPWM_AQCTL_LDAQBMODE_S   2U
#define EPWM_AQCTL_LDAQBMODE_M   0xCU     // Action Qualifier B Load Select
#define EPWM_AQCTL_SHDWAQAMODE   0x10U    // Action Qualifer A Operating Mode
#define EPWM_AQCTL_SHDWAQBMODE   0x40U    // Action Qualifier B Operating Mode
#define EPWM_AQCTL_LDAQASYNC_S   8U
#define EPWM_AQCTL_LDAQASYNC_M   0x300U   // AQCTLA Register Load on SYNC
#define EPWM_AQCTL_LDAQBSYNC_S   10U
#define EPWM_AQCTL_LDAQBSYNC_M   0xC00U   // AQCTLB Register Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQTSRCSEL register
//
//*************************************************************************************************
#define EPWM_AQTSRCSEL_T1SEL_S   0U
#define EPWM_AQTSRCSEL_T1SEL_M   0xFU    // T1 Event Source Select Bits
#define EPWM_AQTSRCSEL_T2SEL_S   4U
#define EPWM_AQTSRCSEL_T2SEL_M   0xF0U   // T2 Event Source Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCCTL register
//
//*************************************************************************************************
#define EPWM_PCCTL_CHPEN       0x1U     // PWM chopping enable
#define EPWM_PCCTL_OSHTWTH_S   1U
#define EPWM_PCCTL_OSHTWTH_M   0x1EU    // One-shot pulse width
#define EPWM_PCCTL_CHPFREQ_S   5U
#define EPWM_PCCTL_CHPFREQ_M   0xE0U    // Chopping clock frequency
#define EPWM_PCCTL_CHPDUTY_S   8U
#define EPWM_PCCTL_CHPDUTY_M   0x700U   // Chopping clock Duty cycle

//*************************************************************************************************
//
// The following are defines for the bit fields in the VCAPCTL register
//
//*************************************************************************************************
#define EPWM_VCAPCTL_VCAPE            0x1U     // Valley  Capture mode
#define EPWM_VCAPCTL_VCAPSTART        0x2U     // Valley  Capture Start
#define EPWM_VCAPCTL_TRIGSEL_S        2U
#define EPWM_VCAPCTL_TRIGSEL_M        0x1CU    // Capture Trigger Select
#define EPWM_VCAPCTL_VDELAYDIV_S      7U
#define EPWM_VCAPCTL_VDELAYDIV_M      0x380U   // Valley Delay Mode Divide Enable
#define EPWM_VCAPCTL_EDGEFILTDLYSEL   0x400U   // Valley Switching Mode Delay Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the VCNTCFG register
//
//*************************************************************************************************
#define EPWM_VCNTCFG_STARTEDGE_S    0U
#define EPWM_VCNTCFG_STARTEDGE_M    0xFU      // Counter Start Edge Selection
#define EPWM_VCNTCFG_STARTEDGESTS   0x80U     // Start Edge Status Bit
#define EPWM_VCNTCFG_STOPEDGE_S     8U
#define EPWM_VCNTCFG_STOPEDGE_M     0xF00U    // Counter Start Edge Selection
#define EPWM_VCNTCFG_STOPEDGESTS    0x8000U   // Stop Edge Status Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCNFG register
//
//*************************************************************************************************
#define EPWM_HRCNFG_EDGMODE_S    0U
#define EPWM_HRCNFG_EDGMODE_M    0x3U      // ePWMxA Edge Mode Select Bits
#define EPWM_HRCNFG_CTLMODE      0x4U      // ePWMxA Control Mode Select Bits
#define EPWM_HRCNFG_HRLOAD_S     3U
#define EPWM_HRCNFG_HRLOAD_M     0x18U     // ePWMxA Shadow Mode Select Bits
#define EPWM_HRCNFG_SELOUTB      0x20U     // EPWMB Output Selection Bit
#define EPWM_HRCNFG_AUTOCONV     0x40U     // Autoconversion Bit
#define EPWM_HRCNFG_SWAPAB       0x80U     // Swap EPWMA and EPWMB Outputs Bit
#define EPWM_HRCNFG_EDGMODEB_S   8U
#define EPWM_HRCNFG_EDGMODEB_M   0x300U    // ePWMxB Edge Mode Select Bits
#define EPWM_HRCNFG_CTLMODEB     0x400U    // ePWMxB Control Mode Select Bits
#define EPWM_HRCNFG_HRLOADB_S    11U
#define EPWM_HRCNFG_HRLOADB_M    0x1800U   // ePWMxB Shadow Mode Select Bits

