TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_epwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the TZOSTCLR register
//
//*************************************************************************************************
#define EPWM_TZOSTCLR_OST1      0x1U     // Clear Flag for Oneshot (OST1) Trip Latch
#define EPWM_TZOSTCLR_OST2      0x2U     // Clear Flag for Oneshot (OST2) Trip Latch
#define EPWM_TZOSTCLR_OST3      0x4U     // Clear Flag for Oneshot (OST3) Trip Latch
#define EPWM_TZOSTCLR_OST4      0x8U     // Clear Flag for Oneshot (OST4) Trip Latch
#define EPWM_TZOSTCLR_OST5      0x10U    // Clear Flag for Oneshot (OST5) Trip Latch
#define EPWM_TZOSTCLR_OST6      0x20U    // Clear Flag for Oneshot (OST6) Trip Latch
#define EPWM_TZOSTCLR_DCAEVT1   0x40U    // Clear Flag for DCAEVT1 selected for OST
#define EPWM_TZOSTCLR_DCBEVT1   0x80U    // Clear Flag for DCBEVT1 selected for OST
#define EPWM_TZOSTCLR_CAPEVT    0x100U   // Clear Flag for CAPEVT selected for OST

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZFRC register
//
//*************************************************************************************************
#define EPWM_TZFRC_CBC       0x2U    // Force Trip Zones Cycle By Cycle Event
#define EPWM_TZFRC_OST       0x4U    // Force Trip Zones One Shot Event
#define EPWM_TZFRC_DCAEVT1   0x8U    // Force Digital Compare A Event 1
#define EPWM_TZFRC_DCAEVT2   0x10U   // Force Digital Compare A Event 2
#define EPWM_TZFRC_DCBEVT1   0x20U   // Force Digital Compare B Event 1
#define EPWM_TZFRC_DCBEVT2   0x40U   // Force Digital Compare B Event 2
#define EPWM_TZFRC_CAPEVT    0x80U   // Force Capture Event

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZTRIPOUTSEL register
//
//*************************************************************************************************
#define EPWM_TZTRIPOUTSEL_OST       0x1U      // OST TRIPOUT select
#define EPWM_TZTRIPOUTSEL_CBC       0x2U      // CBC TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ1       0x4U      // TZ1 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ2       0x8U      // TZ2 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ3       0x10U     // TZ3 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ4       0x20U     // TZ4 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ5       0x40U     // TZ5 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_TZ6       0x80U     // TZ6 TRIPOUT select
#define EPWM_TZTRIPOUTSEL_DCAEVT1   0x100U    // DCAEVT1.force TRIPOUT select
#define EPWM_TZTRIPOUTSEL_DCAEVT2   0x200U    // DCAEVT2.force TRIPOUT select
#define EPWM_TZTRIPOUTSEL_DCBEVT1   0x400U    // DCBEVT1.force TRIPOUT select
#define EPWM_TZTRIPOUTSEL_DCBEVT2   0x800U    // DCBEVT2.force TRIPOUT select
#define EPWM_TZTRIPOUTSEL_CAPEVT    0x1000U   // CAPEVT TRIPOUT select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETSEL register
//
//*************************************************************************************************
#define EPWM_ETSEL_INTSEL_S     0U
#define EPWM_ETSEL_INTSEL_M     0x7U      // EPWMxINTn Select
#define EPWM_ETSEL_INTEN        0x8U      // EPWMxINTn Enable
#define EPWM_ETSEL_SOCASELCMP   0x10U     // EPWMxSOCA Compare Select
#define EPWM_ETSEL_SOCBSELCMP   0x20U     // EPWMxSOCB Compare Select
#define EPWM_ETSEL_INTSELCMP    0x40U     // EPWMxINT Compare Select
#define EPWM_ETSEL_SOCASEL_S    8U
#define EPWM_ETSEL_SOCASEL_M    0x700U    // Start of Conversion A Select
#define EPWM_ETSEL_SOCAEN       0x800U    // Start of Conversion A Enable
#define EPWM_ETSEL_SOCBSEL_S    12U
#define EPWM_ETSEL_SOCBSEL_M    0x7000U   // Start of Conversion B Select
#define EPWM_ETSEL_SOCBEN       0x8000U   // Start of Conversion B Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETPS register
//
//*************************************************************************************************
#define EPWM_ETPS_INTPRD_S    0U
#define EPWM_ETPS_INTPRD_M    0x3U      // EPWMxINTn Period Select
#define EPWM_ETPS_INTCNT_S    2U
#define EPWM_ETPS_INTCNT_M    0xCU      // EPWMxINTn Counter Register
#define EPWM_ETPS_INTPSSEL    0x10U     // EPWMxINTn Pre-Scale Selection Bits
#define EPWM_ETPS_SOCPSSEL    0x20U     // EPWMxSOC A/B  Pre-Scale Selection Bits
#define EPWM_ETPS_SOCAPRD_S   8U
#define EPWM_ETPS_SOCAPRD_M   0x300U    // EPWMxSOCA Period Select
#define EPWM_ETPS_SOCACNT_S   10U
#define EPWM_ETPS_SOCACNT_M   0xC00U    // EPWMxSOCA Counter Register
#define EPWM_ETPS_SOCBPRD_S   12U
#define EPWM_ETPS_SOCBPRD_M   0x3000U   // EPWMxSOCB Period Select
#define EPWM_ETPS_SOCBCNT_S   14U
#define EPWM_ETPS_SOCBCNT_M   0xC000U   // EPWMxSOCB Counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETFLG register
//
//*************************************************************************************************
#define EPWM_ETFLG_INT    0x1U   // EPWMxINTn Flag
#define EPWM_ETFLG_SOCA   0x4U   // EPWMxSOCA Flag
#define EPWM_ETFLG_SOCB   0x8U   // EPWMxSOCB Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETCLR register
//
//*************************************************************************************************
#define EPWM_ETCLR_INT    0x1U   // EPWMxINTn Clear
#define EPWM_ETCLR_SOCA   0x4U   // EPWMxSOCA Clear
#define EPWM_ETCLR_SOCB   0x8U   // EPWMxSOCB Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETFRC register
//
//*************************************************************************************************
#define EPWM_ETFRC_INT    0x1U   // EPWMxINTn Force
#define EPWM_ETFRC_SOCA   0x4U   // EPWMxSOCA Force
#define EPWM_ETFRC_SOCB   0x8U   // EPWMxSOCB Force

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETINTPS register
//
//*************************************************************************************************
#define EPWM_ETINTPS_INTPRD2_S   0U
#define EPWM_ETINTPS_INTPRD2_M   0xFU    // EPWMxINTn Period Select
#define EPWM_ETINTPS_INTCNT2_S   4U
#define EPWM_ETINTPS_INTCNT2_M   0xF0U   // EPWMxINTn Counter Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETSOCPS register
//
//*************************************************************************************************
#define EPWM_ETSOCPS_SOCAPRD2_S   0U
#define EPWM_ETSOCPS_SOCAPRD2_M   0xFU      // EPWMxSOCA Period Select
#define EPWM_ETSOCPS_SOCACNT2_S   4U
#define EPWM_ETSOCPS_SOCACNT2_M   0xF0U     // EPWMxSOCA Counter Register
#define EPWM_ETSOCPS_SOCBPRD2_S   8U
#define EPWM_ETSOCPS_SOCBPRD2_M   0xF00U    // EPWMxSOCB Period Select
#define EPWM_ETSOCPS_SOCBCNT2_S   12U
#define EPWM_ETSOCPS_SOCBCNT2_M   0xF000U   // EPWMxSOCB Counter Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETCNTINITCTL register
//
//*************************************************************************************************
#define EPWM_ETCNTINITCTL_INTINITFRC    0x400U    // EPWMxINT Counter Initialization Force
#define EPWM_ETCNTINITCTL_SOCAINITFRC   0x800U    // EPWMxSOCA Counter Initialization Force
#define EPWM_ETCNTINITCTL_SOCBINITFRC   0x1000U   // EPWMxSOCB Counter Initialization Force
#define EPWM_ETCNTINITCTL_INTINITEN     0x2000U   // EPWMxINT Counter Initialization Enable
#define EPWM_ETCNTINITCTL_SOCAINITEN    0x4000U   // EPWMxSOCA Counter Initialization Enable
#define EPWM_ETCNTINITCTL_SOCBINITEN    0x8000U   // EPWMxSOCB Counter Initialization Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETCNTINIT register
//
//*************************************************************************************************
#define EPWM_ETCNTINIT_INTINIT_S    0U
#define EPWM_ETCNTINIT_INTINIT_M    0xFU     // EPWMxINT Counter Initialization Bits
#define EPWM_ETCNTINIT_SOCAINIT_S   4U
#define EPWM_ETCNTINIT_SOCAINIT_M   0xF0U    // EPWMxSOCA Counter Initialization Bits
#define EPWM_ETCNTINIT_SOCBINIT_S   8U
#define EPWM_ETCNTINIT_SOCBINIT_M   0xF00U   // EPWMxSOCB Counter Initialization Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETINTMIXEN register
//
//*************************************************************************************************
#define EPWM_ETINTMIXEN_ZRO       0x1U     // Zero match enable to ETINTMIX
#define EPWM_ETINTMIXEN_PRD       0x2U     // Period match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CAU       0x4U     // CMPA up-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CAD       0x8U     // CMPA down-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CBU       0x10U    // CMPB up-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CBD       0x20U    // CMPB down-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CCU       0x40U    // CMPC up-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CCD       0x80U    // CMPC down-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CDU       0x100U   // CMPD up-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_CDD       0x200U   // CMPD down-count match enable to ETINTMIX
#define EPWM_ETINTMIXEN_DCAEVT1   0x400U   // DCAEVT1.inter enable to ETINTMIX

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETSOCAMIXEN register
//
//*************************************************************************************************
#define EPWM_ETSOCAMIXEN_ZRO       0x1U     // Zero match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_PRD       0x2U     // Period match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CAU       0x4U     // CMPA up-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CAD       0x8U     // CMPA down-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CBU       0x10U    // CMPB up-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CBD       0x20U    // CMPB down-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CCU       0x40U    // CMPC up-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CCD       0x80U    // CMPC down-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CDU       0x100U   // CMPD up-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_CDD       0x200U   // CMPD down-count match enable to ETSOCAMIX
#define EPWM_ETSOCAMIXEN_DCAEVT1   0x400U   // DCAEVT1.inter enable to ETSOCAMIX

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETSOCBMIXEN register
//
//*************************************************************************************************
#define EPWM_ETSOCBMIXEN_ZRO       0x1U     // Zero match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_PRD       0x2U     // Period match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CAU       0x4U     // CMPA up-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CAD       0x8U     // CMPA down-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CBU       0x10U    // CMPB up-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CBD       0x20U    // CMPB down-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CCU       0x40U    // CMPC up-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CCD       0x80U    // CMPC down-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CDU       0x100U   // CMPD up-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_CDD       0x200U   // CMPD down-count match enable to ETSOCBMIX
#define EPWM_ETSOCBMIXEN_DCBEVT1   0x400U   // DCBEVT1.inter enable to ETSOCBMIX

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCTRIPSEL register
//
//*************************************************************************************************
#define EPWM_DCTRIPSEL_DCAHCOMPSEL_S   0U
#define EPWM_DCTRIPSEL_DCAHCOMPSEL_M   0xFU      // Digital Compare A High COMP Input Select
#define EPWM_DCTRIPSEL_DCALCOMPSEL_S   4U
#define EPWM_DCTRIPSEL_DCALCOMPSEL_M   0xF0U     // Digital Compare A Low COMP Input Select
#define EPWM_DCTRIPSEL_DCBHCOMPSEL_S   8U
#define EPWM_DCTRIPSEL_DCBHCOMPSEL_M   0xF00U    // Digital Compare B High COMP Input Select
#define EPWM_DCTRIPSEL_DCBLCOMPSEL_S   12U
#define EPWM_DCTRIPSEL_DCBLCOMPSEL_M   0xF000U   // Digital Compare B Low COMP Input Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCACTL register
//
//*************************************************************************************************
#define EPWM_DCACTL_EVT1SRCSEL        0x1U      // DCAEVT1 Source Signal
#define EPWM_DCACTL_EVT1FRCSYNCSEL    0x2U      // DCAEVT1 Force Sync Signal
#define EPWM_DCACTL_EVT1SOCE          0x4U      // DCAEVT1 SOC Enable
#define EPWM_DCACTL_EVT1SYNCE         0x8U      // DCAEVT1 SYNC Enable
#define EPWM_DCACTL_EVT1LATSEL        0x10U     // DCAEVT1 Latched signal select
#define EPWM_DCACTL_EVT1LATCLRSEL_S   5U
#define EPWM_DCACTL_EVT1LATCLRSEL_M   0x60U     // DCAEVT1 Latched clear source select
#define EPWM_DCACTL_EVT1LAT           0x80U     // Indicates the status of DCAEVT1LAT signal.
#define EPWM_DCACTL_EVT2SRCSEL        0x100U    // DCAEVT2 Source Signal
#define EPWM_DCACTL_EVT2FRCSYNCSEL    0x200U    // DCAEVT2 Force Sync Signal
#define EPWM_DCACTL_EVT2LATSEL        0x1000U   // DCAEVT2 Latched signal select
#define EPWM_DCACTL_EVT2LATCLRSEL_S   13U
#define EPWM_DCACTL_EVT2LATCLRSEL_M   0x6000U   // DCAEVT2 Latched clear source select
#define EPWM_DCACTL_EVT2LAT           0x8000U   // Indicates the status of DCAEVT2LAT signal.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCBCTL register
//
//*************************************************************************************************
#define EPWM_DCBCTL_EVT1SRCSEL        0x1U      // DCBEVT1 Source Signal
#define EPWM_DCBCTL_EVT1FRCSYNCSEL    0x2U      // DCBEVT1 Force Sync Signal
#define EPWM_DCBCTL_EVT1SOCE          0x4U      // DCBEVT1 SOC Enable
#define EPWM_DCBCTL_EVT1SYNCE         0x8U      // DCBEVT1 SYNC Enable
#define EPWM_DCBCTL_EVT1LATSEL        0x10U     // DCBEVT1 Latched signal select
#define EPWM_DCBCTL_EVT1LATCLRSEL_S   5U
#define EPWM_DCBCTL_EVT1LATCLRSEL_M   0x60U     // DCBEVT1 Latched clear source select
#define EPWM_DCBCTL_EVT1LAT           0x80U     // Indicates the status of DCBEVT1LAT signal.
#define EPWM_DCBCTL_EVT2SRCSEL        0x100U    // DCBEVT2 Source Signal
#define EPWM_DCBCTL_EVT2FRCSYNCSEL    0x200U    // DCBEVT2 Force Sync Signal
#define EPWM_DCBCTL_EVT2LATSEL        0x1000U   // DCBEVT2 Latched signal select
#define EPWM_DCBCTL_EVT2LATCLRSEL_S   13U
#define EPWM_DCBCTL_EVT2LATCLRSEL_M   0x6000U   // DCBEVT2 Latched clear source select
#define EPWM_DCBCTL_EVT2LAT           0x8000U   // Indicates the status of DCBEVT2LAT signal.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCFCTL register
//
//*************************************************************************************************
#define EPWM_DCFCTL_SRCSEL_S       0U
#define EPWM_DCFCTL_SRCSEL_M       0x3U      // Filter Block Signal Source Select
#define EPWM_DCFCTL_BLANKE         0x4U      // Blanking Enable/Disable
#define EPWM_DCFCTL_BLANKINV       0x8U      // Blanking Window Inversion
#define EPWM_DCFCTL_PULSESEL_S     4U
#define EPWM_DCFCTL_PULSESEL_M     0x30U     // Pulse Select for Blanking & Capture Alignment
#define EPWM_DCFCTL_EDGEFILTSEL    0x40U     // Edge Filter Select
#define EPWM_DCFCTL_EDGEMODE_S     8U
#define EPWM_DCFCTL_EDGEMODE_M     0x300U    // Edge Mode
#define EPWM_DCFCTL_EDGECOUNT_S    10U
#define EPWM_DCFCTL_EDGECOUNT_M    0x1C00U   // Edge Count
#define EPWM_DCFCTL_EDGESTATUS_S   13U
#define EPWM_DCFCTL_EDGESTATUS_M   0xE000U   // Edge Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCCAPCTL register
//
//*************************************************************************************************
#define EPWM_DCCAPCTL_CAPE       0x1U      // Counter Capture Enable
#define EPWM_DCCAPCTL_SHDWMODE   0x2U      // Counter Capture Mode
#define EPWM_DCCAPCTL_CAPSTS     0x2000U   // Latched Status Flag for Capture Event
#define EPWM_DCCAPCTL_CAPCLR     0x4000U   // DC Capture Latched Status Clear Flag
#define EPWM_DCCAPCTL_CAPMODE    0x8000U   // Counter Capture Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the BLANKPULSEMIXSEL register
//
//*************************************************************************************************
#define EPWM_BLANKPULSEMIXSEL_ZRO   0x1U     // Zero match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_PRD   0x2U     // Period match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CAU   0x4U     // CMPA up-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CAD   0x8U     // CMPA down-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CBU   0x10U    // CMPB up-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CBD   0x20U    // CMPB down-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CCU   0x40U    // CMPC up-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CCD   0x80U    // CMPC down-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CDU   0x100U   // CMPD up-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CDD   0x200U   // CMPD down-count match enable to BLANKPULSEMIX

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCCAPMIXSEL register
//
//*************************************************************************************************
#define EPWM_DCCAPMIXSEL_ZRO   0x1U     // Zero match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_PRD   0x2U     // Period match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CAU   0x4U     // CMPA up-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CAD   0x8U     // CMPA down-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CBU   0x10U    // CMPB up-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CBD   0x20U    // CMPB down-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CCU   0x40U    // CMPC up-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CCD   0x80U    // CMPC down-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CDU   0x100U   // CMPD up-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CDD   0x200U   // CMPD down-count match enable to DCCAPMIX

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCAHTRIPSEL register
//
//*************************************************************************************************
#define EPWM_DCAHTRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to DCAH Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCALTRIPSEL register
//
//*************************************************************************************************
#define EPWM_DCALTRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to DCAL Mux

