TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_epwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the DCBHTRIPSEL register
//
//*************************************************************************************************
#define EPWM_DCBHTRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to DCBH Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCBLTRIPSEL register
//
//*************************************************************************************************
#define EPWM_DCBLTRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to DCBL Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPCTL register
//
//*************************************************************************************************
#define EPWM_CAPCTL_SRCSEL         0x1U     // Capture Logic Input Selection
#define EPWM_CAPCTL_CAPGATEPOL_S   1U
#define EPWM_CAPCTL_CAPGATEPOL_M   0x6U     // Polarity selection for Capture Gate input
#define EPWM_CAPCTL_CAPINPOL       0x8U     // Polarity selection for Capture input
#define EPWM_CAPCTL_PULSECTL       0x10U    // Polarity selection for Capture input
#define EPWM_CAPCTL_FRCLOAD        0x100U   // Capture event force load

//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPGATETRIPSEL register
//
//*************************************************************************************************
#define EPWM_CAPGATETRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to CAPGATE Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPINTRIPSEL register
//
//*************************************************************************************************
#define EPWM_CAPINTRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to CAPIN Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPTRIPSEL register
//
//*************************************************************************************************
#define EPWM_CAPTRIPSEL_CAPINCOMPSEL_S     0U
#define EPWM_CAPTRIPSEL_CAPINCOMPSEL_M     0xFU    // CAPIN Comparator Input Select
#define EPWM_CAPTRIPSEL_CAPGATECOMPSEL_S   4U
#define EPWM_CAPTRIPSEL_CAPGATECOMPSEL_M   0xF0U   // CAPGATE Comparator COMP Input Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMLOCK register
//
//*************************************************************************************************
#define EPWM_LOCK_HRLOCK      0x1U          // HRPWM Register Set Lock
#define EPWM_LOCK_GLLOCK      0x2U          // Global Load Register Set Lock
#define EPWM_LOCK_TZCFGLOCK   0x4U          // TripZone Register Set Lock
#define EPWM_LOCK_TZCLRLOCK   0x8U          // TripZone Clear Register Set Lock
#define EPWM_LOCK_DCLOCK      0x10U         // Digital Compare Register Set Lock
#define EPWM_LOCK_KEY_S       16U
#define EPWM_LOCK_KEY_M       0xFFFF0000U   // Key to write to this register


//*************************************************************************************************
//
// The following are defines for the bit fields in the DECTL register
//
//*************************************************************************************************
#define EPWM_DECTL_ENABLE         0x1U      // DE function enable.
#define EPWM_DECTL_MODE           0x2U      // DE Mode
#define EPWM_DECTL_REENTRYDLY_S   8U
#define EPWM_DECTL_REENTRYDLY_M   0xFF00U   // Re-entry delay value

//*************************************************************************************************
//
// The following are defines for the bit fields in the DECOMPSEL register
//
//*************************************************************************************************
#define EPWM_DECOMPSEL_TRIPL_S   0U
#define EPWM_DECOMPSEL_TRIPL_M   0x3FU       // Comparator TRIPL source select.
#define EPWM_DECOMPSEL_TRIPH_S   16U
#define EPWM_DECOMPSEL_TRIPH_M   0x3F0000U   // Comparator TRIPH source select.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEACTCTL register
//
//*************************************************************************************************
#define EPWM_DEACTCTL_PWMA_S       0U
#define EPWM_DEACTCTL_PWMA_M       0x3U       // Comparator source select.
#define EPWM_DEACTCTL_TRIPSELA     0x4U       // Trip source select on PWMA output
#define EPWM_DEACTCTL_PWMB_S       4U
#define EPWM_DEACTCTL_PWMB_M       0x30U      // Comparator source select.
#define EPWM_DEACTCTL_TRIPSELB     0x40U      // Trip source select on PWMB output
#define EPWM_DEACTCTL_TRIPENABLE   0x10000U   // Enables PWMTRIP condition to bypassDiode emulation
                                              // logic.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DESTS register
//
//*************************************************************************************************
#define EPWM_DESTS_DEACTIVE   0x1U   // Diode Emulation mode active flag.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEFRC register
//
//*************************************************************************************************
#define EPWM_DEFRC_DEACTIVE   0x1U   // Diode Emulation mode active flag force.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DECLR register
//
//*************************************************************************************************
#define EPWM_DECLR_DEACTIVE   0x1U   // Diode Emulation mode active flag clear.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONCNT register
//
//*************************************************************************************************
#define EPWM_DEMONCNT_CNT_S   0U
#define EPWM_DEMONCNT_CNT_M   0xFFFFU   // DEACTIVE monitor counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONCTL register
//
//*************************************************************************************************
#define EPWM_DEMONCTL_ENABLE   0x1U   // DEACTIVE monitor counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONSTEP register
//
//*************************************************************************************************
#define EPWM_DEMONSTEP_INCSTEP_S   0U
#define EPWM_DEMONSTEP_INCSTEP_M   0xFFU       // DE monitor counter increment step.
#define EPWM_DEMONSTEP_DECSTEP_S   16U
#define EPWM_DEMONSTEP_DECSTEP_M   0xFF0000U   // DE monitor counter decrement step.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONTHRES register
//
//*************************************************************************************************
#define EPWM_DEMONTHRES_THRESHOLD_S   0U
#define EPWM_DEMONTHRES_THRESHOLD_M   0xFFFFU   // DE monitor counter compare threshold.


//*************************************************************************************************
//
// The following are defines for the bit fields in the MINDBCFG register
//
//*************************************************************************************************
#define EPWM_MINDBCFG_ENABLEA     0x1U         // Minimum dead band logic enable on PWMA
#define EPWM_MINDBCFG_INVERTA     0x4U         // Invert the selected reference signal on PWMA
#define EPWM_MINDBCFG_SELBLOCKA   0x8U         // BLOCK signal source select on PWMA
#define EPWM_MINDBCFG_SELA_S      4U
#define EPWM_MINDBCFG_SELA_M      0xF0U        // Reference source select on PWMA min dead band
                                               // logic.
#define EPWM_MINDBCFG_POLSELA     0x100U       // Select signal for the AND OR logic of PWMA
#define EPWM_MINDBCFG_ENABLEB     0x10000U     // Minimum dead band logic enable on PWMB
#define EPWM_MINDBCFG_INVERTB     0x40000U     // Invert the selected reference signal on PWMB
#define EPWM_MINDBCFG_SELBLOCKB   0x80000U     // BLOCK signal source select on PWMB
#define EPWM_MINDBCFG_SELB_S      20U
#define EPWM_MINDBCFG_SELB_M      0xF00000U    // Reference source select on PWMB min dead band
                                               // logic.
#define EPWM_MINDBCFG_POLSELB     0x1000000U   // Select signal for the AND OR logic of PWMB

//*************************************************************************************************
//
// The following are defines for the bit fields in the MINDBDLY register
//
//*************************************************************************************************
#define EPWM_MINDBDLY_DELAYA_S   0U
#define EPWM_MINDBDLY_DELAYA_M   0xFFFFU       // Minimum dead band delay on PWMA
#define EPWM_MINDBDLY_DELAYB_S   16U
#define EPWM_MINDBDLY_DELAYB_M   0xFFFF0000U   // Minimum dead band delay on PWMB

//*************************************************************************************************
//
// The following are defines for the bit fields in the LUTCTLA register
//
//*************************************************************************************************
#define EPWM_LUTCTLA_BYPASS      0x1U        // Bypass LUTA
#define EPWM_LUTCTLA_SELXBAR_S   4U
#define EPWM_LUTCTLA_SELXBAR_M   0xF0U       // ICSS XBAR select
#define EPWM_LUTCTLA_LUTDEC0     0x10000U    // LUT output PWMA value on decoding 0
#define EPWM_LUTCTLA_LUTDEC1     0x20000U    // LUT output PWMA value on decoding 1
#define EPWM_LUTCTLA_LUTDEC2     0x40000U    // LUT output PWMA value on decoding 2
#define EPWM_LUTCTLA_LUTDEC3     0x80000U    // LUT output PWMA value on decoding 3
#define EPWM_LUTCTLA_LUTDEC4     0x100000U   // LUT output PWMA value on decoding 4
#define EPWM_LUTCTLA_LUTDEC5     0x200000U   // LUT output PWMA value on decoding 5
#define EPWM_LUTCTLA_LUTDEC6     0x400000U   // LUT output PWMA value on decoding 6
#define EPWM_LUTCTLA_LUTDEC7     0x800000U   // LUT output PWMA value on decoding 7

//*************************************************************************************************
//
// The following are defines for the bit fields in the LUTCTLB register
//
//*************************************************************************************************
#define EPWM_LUTCTLB_BYPASS      0x1U        // Bypass LUTB
#define EPWM_LUTCTLB_SELXBAR_S   4U
#define EPWM_LUTCTLB_SELXBAR_M   0xF0U       // ICSS XBAR select
#define EPWM_LUTCTLB_LUTDEC0     0x10000U    // LUT output PWMB value on decoding 0
#define EPWM_LUTCTLB_LUTDEC1     0x20000U    // LUT output PWMB value on decoding 1
#define EPWM_LUTCTLB_LUTDEC2     0x40000U    // LUT output PWMB value on decoding 2
#define EPWM_LUTCTLB_LUTDEC3     0x80000U    // LUT output PWMB value on decoding 3
#define EPWM_LUTCTLB_LUTDEC4     0x100000U   // LUT output PWMB value on decoding 4
#define EPWM_LUTCTLB_LUTDEC5     0x200000U   // LUT output PWMB value on decoding 5
#define EPWM_LUTCTLB_LUTDEC6     0x400000U   // LUT output PWMB value on decoding 6
#define EPWM_LUTCTLB_LUTDEC7     0x800000U   // LUT output PWMB value on decoding 7



#endif
